; domain
(define (domain library-domain)

    (:requirements :strips)

    (:predicates (loc ?x) (workbench ?x) (at ?x ?y)
                (book ?x) (standard-book ?x) (rare-book ?x)
                (tool ?x) (kit ?x) (jacket ?x)
                (free-hand-book) (holding-book ?x)
                (free-hand-tool) (holding-tool ?x)
                (restored ?x)
    )

    ;; Action to pick up a Standard Book
    ;; Same logic as 'pick-dog': no extra tools required.
    (:action pick-standard-book
        :parameters (?b ?l)
        :precondition (and
            (standard-book ?b)
            (book ?b)
            (loc ?l)
            (at ?b ?l)
            (free-hand-book)
        )
        :effect (and
            (holding-book ?b)
            (not (at ?b ?l))
            (not (free-hand-book))
        )
    )

    ;; Action to pick up a Rare Book
    ;; LOGIC ADDED: Requires holding a jacket. The jacket is consumed (removed from hand).
    ;; Corresponds to 'pick-cat' in the Vet domain.
    (:action pick-rare-book
       :parameters (?b ?l ?j)
       :precondition (and
            (rare-book ?b)
            (book ?b)
            (loc ?l)
            (at ?b ?l)
            (free-hand-book)
            (holding-tool ?j)
            (jacket ?j)
       )
       :effect (and
            (holding-book ?b)
            (not (at ?b ?l))
            (not (free-hand-book))

            ;; Jacket is used to wrap the book and is removed from hand
            (free-hand-tool)
            (not (holding-tool ?j))
       )
    )

    ;; Action to drop a book
    (:action drop-book
        :parameters (?b ?l)
        :precondition (and
            (holding-book ?b)
            (book ?b)
            (loc ?l)
        )
        :effect (and
            (at ?b ?l)
            (free-hand-book)
            (not (holding-book ?b))
        )
    )

    ;; Action to pick up a tool (Jacket or Kit)
    (:action pick-tool
        :parameters (?t ?l)
        :precondition (and
            (tool ?t)
            (loc ?l)
            (at ?t ?l)
            (free-hand-tool)
        )
        :effect (and
            (holding-tool ?t)
            (not (at ?t ?l))
            (not (free-hand-tool))
        )
    )

    ;; Action to drop a tool
    (:action drop-tool
        :parameters (?t ?l)
        :precondition (and
            (holding-tool ?t)
            (tool ?t)
            (loc ?l)
        )
        :effect (and
            (at ?t ?l)
            (free-hand-tool)
            (not (holding-tool ?t))
        )
    )

    ;; Action to restore a book
    ;; LOGIC ADDED: Sets the book to 'restored'.
    ;; Corresponds to 'use-syringe' in the Vet domain.
    (:action restore-book
        :parameters (?b ?w ?k)
        :precondition (and
            (book ?b)
            (loc ?w)
            (workbench ?w)
            (at ?b ?w)
            (holding-tool ?k)
            (kit ?k)
        )
        :effect (and
            (restored ?b)
        )
    )
)

; problem
(define (problem library-problem)

    (:domain library-domain)
    (:objects 
        b-std b-rare       ;; The Books
        bench shelf        ;; The Locations
        k                  ;; The Repair Kit
        j1 j2              ;; The Dust Jackets
    )

    (:init 
        ;; Types
        (standard-book b-std) (rare-book b-rare) (book b-std) (book b-rare)
        (tool k) (tool j1) (tool j2) (kit k) (jacket j1) (jacket j2)
        (loc shelf) (loc bench) (workbench bench)
        
        ;; Initial State
        (free-hand-book) (free-hand-tool)
        (at k shelf) (at j1 shelf) (at j2 shelf) 
        (at b-std shelf) (at b-rare shelf)
    )
  
    (:goal (and (restored b-std) (restored b-rare) (at b-std shelf) (at b-rare shelf)))
)

; plan
1. (pick-standard-book b-std shelf)
   deleted: (at b-std shelf) (free-hand-book)
   added: (holding-book b-std)
   goals met: 1 of 4
2. (drop-book b-std bench)
   deleted: (holding-book b-std)
   added: (at b-std bench) (free-hand-book)
   goals met: 1 of 4
3. (pick-tool j1 shelf)
   deleted: (at j1 shelf) (free-hand-tool)
   added: (holding-tool j1)
   goals met: 1 of 4
4. (pick-rare-book b-rare shelf j1)
   deleted: (at b-rare shelf) (free-hand-book) (holding-tool j1)
   added: (holding-book b-rare) (free-hand-tool)
   goals met: 0 of 4
5. (drop-book b-rare bench)
   deleted: (holding-book b-rare)
   added: (at b-rare bench) (free-hand-book)
   goals met: 0 of 4
6. (pick-tool k shelf)
   deleted: (at k shelf) (free-hand-tool)
   added: (holding-tool k)
   goals met: 0 of 4
7. (restore-book b-std bench k)
   added: (restored b-std)
   goals met: 1 of 4
8. (pick-standard-book b-std bench)
   deleted: (at b-std bench) (free-hand-book)
   added: (holding-book b-std)
   goals met: 1 of 4
9. (drop-book b-std shelf)
   deleted: (holding-book b-std)
   added: (at b-std shelf) (free-hand-book)
   goals met: 2 of 4
10. (restore-book b-rare bench k)
   added: (restored b-rare)
   goals met: 3 of 4
11. (drop-tool k shelf)
   deleted: (holding-tool k)
   added: (at k shelf) (free-hand-tool)
   goals met: 3 of 4
12. (pick-tool j2 shelf)
   deleted: (at j2 shelf) (free-hand-tool)
   added: (holding-tool j2)
   goals met: 3 of 4
13. (pick-rare-book b-rare bench j2)
   deleted: (at b-rare bench) (free-hand-book) (holding-tool j2)
   added: (holding-book b-rare) (free-hand-tool)
   goals met: 3 of 4
14. (drop-book b-rare shelf)
   deleted: (holding-book b-rare)
   added: (at b-rare shelf) (free-hand-book)
   goals met: 4 of 4
